{
  "posts": [
    {
      "id": 1,
      "slug": "first-january-2026",
      "title": "First Day of 2026: Cubbon Park Reflections",
      "date": "January 1, 2026",
      "category": "Journal",
      "subcategory": "Thoughts",
      "readTime": "3 min read",
      "coverImage": "images/Cubbon-Park-Bangalore-1.webp",
      "video": "images/WhatsApp Video 2026-01-04 at 8.22.26 PM.mp4",
      "excerpt": "A quiet morning walk in Bangalore's Cubbon Park with friends, reflecting on memories, roots, and the gentle beginning of a new year...",
      "content": [
        {
          "type": "paragraph",
          "text": "1st January 2026. Almost eleven months since I left home, and today Bangalore felt a little less unfamiliar. The city woke up slowly, like someone stretching after a long sleep. We were four—Nilabha, Jyotirmoy, Apurba, and me—walking towards Cubbon Park, carrying nothing heavy except memories that don't ask permission before sitting beside you."
        },
        {
          "type": "paragraph",
          "text": "Cubbon Park is older than most stories we tell ourselves. Built in 1870 during British rule, it stands quietly in the heart of Bangalore, surrounded by government buildings, museums, libraries, and roads that never truly rest. Inside, time behaves differently. Trees older than regrets, paths worn smooth by generations of footsteps, and silence that doesn't feel empty—only patient. Nearby places like Vidhana Soudha, the State Central Library, and MG Road exist almost like witnesses, watching the park breathe while the city runs."
        },
        {
          "type": "image",
          "src": "images/Cubbon-Park-Bangalore-1.webp",
          "caption": "Morning light through the trees of Cubbon Park"
        },
        {
          "type": "paragraph",
          "text": "Families spread picnic mats, couples walked hand in hand as if hope had a physical form, and children ran without deadlines chasing them. Everyone seemed to arrive with the same invisible luggage—new resolutions, half-healed wounds, quiet prayers. The new year had just begun, and the air felt like a promise written in pencil, soft but sincere."
        },
        {
          "type": "paragraph",
          "text": "Not far from here is a Bengali colony, known mostly for its gold and jewellery craftsmanship—hands that turn metal into memory. I've passed it many times, but today it felt closer, like a reminder that roots don't disappear just because distance happens."
        },
        {
          "type": "video",
          "src": "images/WhatsApp Video 2026-01-04 at 8.22.26 PM.mp4"
        },
        {
          "type": "paragraph",
          "text": "The first day of the year wasn't extraordinary, yet it will stay. Maybe because some moments don't announce their importance. They sit quietly, like a bookmark in a book you don't finish—but never forget."
        },
        {
          "type": "paragraph",
          "text": "And yes, it was fun. The kind you remember later, when life gets loud again."
        }
      ],
      "tags": ["Bangalore", "Cubbon Park", "New Year", "Reflections", "Memories", "Friendship", "Journey", "Bengali Colony"],
      "featured": true
    },
    {
      "id": 2,
      "slug": "modern-political-discourse",
      "title": "Modern Political Discourse: Finding Common Ground",
      "date": "December 26, 2023",
      "category": "Politics",
      "readTime": "8 min read",
      "coverImage": "images/IMG_20230216_150120.jpg",
      "excerpt": "In today's polarized world, how do we bridge divides? This article explores my perspective on creating meaningful political conversations...",
      "content": [
        {
          "type": "paragraph",
          "text": "Content coming soon..."
        }
      ],
      "tags": ["Politics", "Society", "Dialogue", "Communication"],
      "featured": false
    },
    {
      "id": 3,
      "slug": "art-of-storytelling",
      "title": "The Art of Storytelling: My Creative Process",
      "date": "December 20, 2023",
      "category": "Creative Writing",
      "readTime": "6 min read",
      "coverImage": "images/IMG_20230216_150120.jpg",
      "excerpt": "How do stories come to life? Join me as I share my writing process, from inspiration to finished piece...",
      "content": [
        {
          "type": "paragraph",
          "text": "Content coming soon..."
        }
      ],
      "tags": ["Writing", "Creativity", "Storytelling", "Process"],
      "featured": false
    }
  ],
  "categories": {
    "Journal": 1,
    "Thoughts": 1,
    "Politics": 1,
    "Creative Writing": 1,
    "Movies": 0,
    "Books": 0
  }
}
